package com.monney.myy;

import java.util.HashMap;


public class pamm {
    public static String[] op = {"เลือกคณะ",
            "คณะกายภาพบำบัด",
            "คณะการสื่อสารมวลชน",
            "คณะเกษตรศาสตร์",
            "คณะเกษตรศาสตร์ทรัพยากรธรรมชาติและสิ่งแวดล้อม",
            "คณะครุศาสตร์",
            "คณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี",
            "คณะจิตวิทยา",
            "คณะทันตแพทยศาสตร์",
            "คณะเทคนิคการแพทย์",
            "คณะเทคนิคการสัตวแพทย์",
            "คณะเทคโนโลยี",
            "คณะเทคโนโลยีการเกษตร",
            "คณะเทคโนโลยีการประมงและทรัพยากรทางน้ำ",
            "คณะเทคโนโลยีและนวัตกรรมผลิตภัณฑ์การเกษตร",
            "คณะเทคโนโลยีสารสนเทศ",
            "คณะเทคโนโลยีสารสนเทศและการสื่อสาร",
            "คณะนิติศาสตร์",
            "คณะนิเทศศาสตร์",
            "คณะบริหารธุรกิจ",
            "คณะบริหารธุรกิจเพื่อสังคม",
            "คณะบริหารธุรกิจและการบัญชี",
            "คณะบริหารธุรกิจเศรษฐศาสตร์และการสื่อสาร",
            "คณะประมง",
            "คณะผลิตกรรมการเกษตร",
            "คณะพยาบาลศาสตร์",
            "คณะพลศึกษา",
            "คณะพัฒนาการท่องเที่ยว",
            "คณะพาณิชยศาสตร์และการบัญชี",
            "คณะแพทยศาสตร์",
            "คณะเภสัชศาสตร์",
            "คณะมนุษยศาสตร์",
            "คณะมนุษยศาสตร์และสังคมศาสตร์",
            "คณะรัฐศาสตร์",
            "คณะรัฐศาสตร์และรัฐประศาสนศาสตร์",
            "คณะวนศาสตร์",
            "คณะวัฒนธรรมสิ่งแวดล้อมและการท่องเที่ยวเชิงนิเวศ",
            "คณะวารสารศาสตร์และสื่อสารมวลชน",
            "คณะวิจิตรศิลป์",
            "คณะวิทยาการเรียนรู้และศึกษาศาสตร์",
            "คณะวิทยาศาสตร์",
            "คณะวิทยาศาสตร์การกีฬา",
            "คณะวิทยาศาสตร์การแพทย์",
            "คณะวิทยาศาสตร์และเทคโนโลยี",
            "คณะวิศวกรรมและอุตสาหกรรมเกษตร",
            "คณะวิศวกรรมศาสตร์",
            "คณะศิลปกรรมศาสตร์",
            "คณะศิลปศาสตร์",
            "คณะศิลปศาสตร์และวิทยาศาสตร์",
            "คณะศึกษาศาสตร์",
            "คณะศึกษาศาสตร์และพัฒนศาสตร์",
            "คณะเศรษฐศาสตร์",
            "คณะสถาปัตยกรรมศาสตร์",
            "คณะสถาปัตยกรรมศาสตร์และการผังเมือง",
            "คณะสถาปัตยกรรมศาสตร์และการออกแบบสิ่งแวดล้อม",
            "คณะสถาปัตยกรรมศิลปะและการออกแบบ",
            "คณะสหวิทยาการ",
            "คณะสหเวชศาสตร์",
            "คณะสังคมวิทยาและมานุษยวิทยา",
            "คณะสังคมศาสตร์",
            "คณะสังคมศาสตร์และมนุษย์ศาสตร์",
            "คณะสังคมสงเคราะห์ศาสตร์",
            "คณะสัตวแพทยศาสตร์",
            "คณะสัตวศาสตร์และเทคโนโลยี",
            "คณะสาธารณสุขศาสตร์",
            "คณะสารสนเทศและการสื่อสาร",
            "คณะสิ่งแวดล้อม",
            "คณะสิ่งแวดล้อมและทรัพยากรศาสตร์",
            "คณะอักษรศาสตร์",
            "คณะอุตสาหกรรมเกษตร",
            "คณะอุตสาหกรรมบริการ",
            "คณะอุตสาหกรรมอาหาร"
    };
    public static String[] maha = {"จุฬา", "ธรรม", "เกษตร", "มช.", "มน.", "มข.", "มศว.", "มหิดล", "ลาดกระบัง", "แม่ฟ้าหลวง", "แม่โจ้"};

    public static HashMap<String, Integer>[] sett() {
        HashMap<String, Integer>[] col = new HashMap[15];
        int leng = op.length;
        for (int i = 0; i < 11; i++) {
            col[i] = new HashMap<>();
            for (int j = 1; j < leng; j++) {
                col[i].put(op[j], -1);
            }
        }
        col[6].put(op[1], 240000);
        col[7].put(op[1], 200000);
        col[3].put(op[2], 224000);
        col[3].put(op[3], 128000);
        col[5].put(op[3], 96000);
        col[4].put(op[4], 128000);
        col[0].put(op[5], 189000);
        col[8].put(op[6], 152000);
        col[0].put(op[7], 265000);
        col[0].put(op[8], 933000);
        col[1].put(op[8], 600000);
        col[3].put(op[8], 470000);
        col[4].put(op[8], 600000);
        col[5].put(op[8], 600000);
        col[6].put(op[8], 600000);
        col[7].put(op[8], 600000);
        col[9].put(op[8], 1800000);
        col[3].put(op[9], 200000);
        col[5].put(op[9], 208000);
        col[7].put(op[9], 200000);
        col[2].put(op[10], 114000);

        col[0].put(op[11], 240000);
        col[1].put(op[11], 200000);
        col[2].put(op[11], 224000);
        col[3].put(op[11], 128000);
        col[4].put(op[11], 96000);
        col[5].put(op[11], 128000);
        col[6].put(op[11], 189000);
        col[7].put(op[11], 152000);
        col[8].put(op[11], 265000);
        col[9].put(op[11], 933000);
        col[10].put(op[11], 600000);
        col[0].put(op[12], 470000);
        col[1].put(op[12], 600000);
        col[2].put(op[12], 600000);
        col[3].put(op[12], 600000);
        col[4].put(op[12], 600000);
        col[5].put(op[12], 1800000);
        col[6].put(op[12], 200000);
        col[7].put(op[12], 208000);
        col[8].put(op[12], 200000);
        col[9].put(op[12], 114000);
        return col;
    }
}
