// initializeData.js
export const options = [
  "แพทย์ศาสตร์",
  "ทันตแพทย์ศาสตร์",
  "สัตวแพทยศาสตร์",
  "พยาบาลศาสตร์",
  "คณะเภสัชศาสตร์",
  "คณะสหเวชศาสตร์",
  "คณะวิทยาศาสตร์การกีฬา",
  "คณะวิทยาศาสตร์",
  "คณะวิศวกรรมศาสตร์",
  "คณะศิลปกรรมศาสตร์",
  "คณะครุศาสตร์",
  "คณะนิติศาสตร์",
  "คณะพาณิชยศาสตร์และการบัญชี",
  "คณะรัฐศาสตร์",
  "คณะเศรษศาสตร์",
  "คณะสาธารณสุขศาสตร์",
  "คณะเกษตรศาสตร์",
  "คณะมนุษยศาสตร์",
  "คณะศึกษาสาตร์",
  "คณะเทคนิคการแพทย์",
  "คณะอุตสาหกรรมเกษตร",
  "คณะเทคโนโลยีการเกษตร",
  "คณะสถาปัตยกรรมศาสตร์",
  "สหสาขาวิชาจุลชีววิทยาทางการแพทย์",
  "สหสาขาวิชาชีวเวชศาสตร์",
  "สหสาขาวิชาทันตชีววัสดุศาสตร์",
  "สหสาขาวิชาสรีรวิทยา",
  "สหสาขาวิชาชีวสารสนเทศศาสตร์และชีววิทยาเชิงคอมพิวเตอร์",
  "คณะจิตวิทยา",
  "วิทยาลัยวิทยาศาสตร์สาธารณสุข",
  "สหสาขาวิชาเภสัชวิทยา",
  "สหสาขาวิชาวิทยาศาสตร์นาโนและเทคโนโลยี",
  "สหสาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม",
  "สหสาขาวิชาการจัดการสารอันตรายและสิ่งแวดล้อม",
  "สหสาขาวิชาเทคโนโลยีและการจัดการพลังงาน",
  "คณะอักษรศาสตร์",
  "คณะนิเทศศาสตร์",
  "คณะพาณิชยศาสตร์และการบัญชี",
  "สหสาขาวิชาการจัดการความเสี่ยงและภัยพิบัติ",
  "สหสาขาวิชาการจัดการโลจิสติกส์และโซ่อุปทาน",
  "สหสาขาวิชาการจัดการทางวัฒนธรรม",
  "สหสาขาวิชาการบริหารกิจการทางทะเล",
  "สหสาขาวิชาเกาหลีศึกษา",
  "สหสาขาวิชาพัฒนามนุษย์และสังคม",
  "สหสาขาวิชาภาษาอังกฤษเป็นภาษานานาชาติ",
  "สหสาขาวิชายุโรปศึกษา",
  "สหสาขาวิชาสิ่งแวดล้อมการพัฒนาและความยั่งยืน",
  "สหสาขาวิชาเอเชียตะวันออกเฉียงใต้ศึกษา",
  "สหสาขาวิชาธุรกิจเทคโนโลยีและการจัดการทางนวัตกรรม",
  "สังคมสงเคราะห์ศาสตร์",
  "สังคมสงเคราะห์ศาสตร์(ลำปาง)",
  "ศิลปศาสตร์",
  "วารสารศาสตร์และสื่อมวลชน",
  "สังคมวิทยาและมานุษยวิทยา",
  "วิทยาศาสตร์และเทคโนโลยี",
  "วิทยาศาสตร์และเทคโนโลยี(ลำปาง)",
  "วิทยาลัยสหวิทยาการ(ลำปาง)",
  "วิทยาการเรียนรู้และศึกษาศาสตร์",
  "วศ.บ.วิศวกรรมศาสตร์ ระบบอัตโนมัติหุ่นยนต์และปัญญาประดิษฐ์",
  "บริหารธุรกิจและการบัญชี",
  "เทคโนโลยี",
  "สหวิทยาการ",
  "มนุษยศาสตร์และสังคมศาสตร์",
  "ศิลปศาสตร์",
  "วิทยาลัยการปกครองท้องถิ่น",
  "วิจิตรศิลป์",
  "สังคมศาสตร์",
  "บริหารธุรกิจ",
  "การสื่อสารมวลชน",
  "วิทยาลัยศิลปะ สื่อและเทคโนโลยี", 
  "บริหารธุรกิจ",
  "สังคมศาสตร์",
  "เทคนิคการสัตวแพทย์",
  "ประมง",
  "วนศาสตร์",
  "ศึกษาศาสตร์และพัฒนศาสตร์",
  "ศิลปศาสตร์และวิทยาศาสตร์ กลุ่มวิทยาศาสตร์",
  "ศิลปศาสตร์และวิทยาศาสตร์ กลุ่มสังคมศาสตร์",
  "คณะเทคโนโลยีสารสนเทศ",
  "คณะการบริหารและจัดการ",
  "วิทยาลัยนวัตกรรมการผลิตขั้นสูง",
  "วิทยาลัยนาโนเทคโนโลยีพระจอมเกล้า",
  "วิทยาลัยวิศวกรรมสังคีต",
  "วิทยาลัยอุตสาหกรรมการบินนานาชาติ",
  "คณะการบริหารและจัดการ",
  "คณะกายภาพบำบัด",
  "คณะศิลปศาสตร์",
  "คณะสังคมศาสตร์และมนุษยศาสตร์",
  "คณะสิ่งแวดล้อมและทรัพยากรศาสตร์",
  "คณะเทคโนโลยีสารสนเทศและการสื่อสาร"
  ];
  
  export const universities = ["จุฬาลงกรณ์มหาวิทยาลัย", "มหาวิทยาลัยธรรมศาสตร์", "มหาลัยขอนแก่น", "มหาลัยเชียงใหม่", "มหาลัยเกษตรศาสตร์", "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง", "มหาลัยมหิดล"];
  const col = new Map();
  const tmp = new Map();
  const sett = () =>{
    options.forEach(op => tmp.set(op,[-1,-1]));
    universities.forEach(uni => col.set(uni,new Map(tmp)));
  }

  export const initializeData = () => {
    sett();
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("แพทย์ศาสตร์",[42500,42500]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("แพทย์ศาสตร์", [21040, 25340]);
    col.get("มหาลัยขอนแก่น").set("แพทย์ศาสตร์", [18000, 18000]);
    col.get("มหาลัยเชียงใหม่").set("แพทย์ศาสตร์", [20000, 20000]);
    col.get("มหาลัยมหิดล").set("แพทย์ศาสตร์", [21000, 35000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("ทันตแพทย์ศาสตร์", [42500, 42500]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("ทันตแพทย์ศาสตร์", [25440, 25440]);
    col.get("มหาลัยขอนแก่น").set("ทันตแพทย์ศาสตร์", [50000, 50000]);
    col.get("มหาลัยเชียงใหม่").set("ทันตแพทย์ศาสตร์", [20000, 20000]);
    col.get("มหาลัยมหิดล").set("ทันตแพทย์ศาสตร์", [50000, 50000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สัตวแพทยศาสตร์", [42500, 42500]);
    col.get("มหาลัยขอนแก่น").set("สัตวแพทยศาสตร์", [35000, 35000]);
    col.get("มหาลัยเชียงใหม่").set("สัตวแพทยศาสตร์", [20000, 20000]);
    col.get("มหาลัยเกษตรศาสตร์").set("สัตวแพทยศาสตร์", [19800, 19800]);
    col.get("มหาลัยมหิดล").set("สัตวแพทยศาสตร์", [25000, 25000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("พยาบาลศาสตร์", [33125, 33125]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("พยาบาลศาสตร์", [20040, 20040]);
    col.get("มหาลัยขอนแก่น").set("พยาบาลศาสตร์", [18000, 18000]);
    col.get("มหาลัยเชียงใหม่").set("พยาบาลศาสตร์", [20000, 20000]);
    col.get("มหาลัยมหิดล").set("พยาบาลศาสตร์", [25000, 25000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะเภสัชศาสตร์",[33125,33125]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("คณะเภสัชศาสตร์",[56240,56240]);
    col.get("มหาลัยขอนแก่น").set("คณะเภสัชศาสตร์",[18000,35000]);
    col.get("มหาลัยเชียงใหม่").set("คณะเภสัชศาสตร์",[20000,20000]);
    col.get("มหาลัยมหิดล").set("คณะเภสัชศาสตร์",[30000,30000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะสหเวชศาสตร์",[33125,33125]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("คณะสหเวชศาสตร์",[20740,20740]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะวิทยาศาสตร์การกีฬา",[33125,33125]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะวิทยาศาสตร์การกีฬา",[19800,19800]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะวิทยาศาสตร์",[31875,31875]);
    col.get("มหาลัยขอนแก่น").set("คณะวิทยาศาสตร์",[12000,30000]);
    col.get("มหาลัยเชียงใหม่").set("คณะวิทยาศาสตร์",[16000,16000]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะวิทยาศาสตร์",[19800,19800]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("คณะวิทยาศาสตร์",[19000,19000]);
    col.get("มหาลัยมหิดล").set("คณะวิทยาศาสตร์",[21000,21000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะวิศวกรรมศาสตร์",[31875,31875]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("คณะวิศวกรรมศาสตร์",[22440,22440]);
    col.get("มหาลัยขอนแก่น").set("คณะวิศวกรรมศาสตร์",[15000,45000]);
    col.get("มหาลัยเชียงใหม่").set("คณะวิศวกรรมศาสตร์",[16000,16000]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะวิศวกรรมศาสตร์",[20800,20800]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("คณะวิศวกรรมศาสตร์",[20000,120000]);
    col.get("มหาลัยมหิดล").set("คณะวิศวกรรมศาสตร์",[30000,30000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะศิลปกรรมศาสตร์",[26250,26250]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("คณะศิลปกรรมศาสตร์",[21240,26340]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะครุศาสตร์",[26250,26250]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("คณะครุศาสตร์",[19000,19000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะนิติศาสตร์",[26250,26250]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("คณะนิติศาสตร์",[18040,23040]);
    col.get("มหาลัยขอนแก่น").set("คณะนิติศาสตร์",[18000,18000]);
    col.get("มหาลัยเชียงใหม่").set("คณะนิติศาสตร์",[15000,15000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะพาณิชยศาสตร์และการบัญชี",[26250,26250]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("คณะพาณิชยศาสตร์และการบัญชี",[18440,18440]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะรัฐศาสตร์",[26250,26250]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("คณะรัฐศาสตร์",[17240,17240]);
    col.get("มหาลัยเชียงใหม่").set("คณะรัฐศาสตร์",[15000,15000]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะเศรษศาสตร์",[26250,26250]);
    col.get("มหาลัยขอนแก่น").set("คณะเศรษศาสตร์",[25000,40000]);
    col.get("มหาลัยเชียงใหม่").set("คณะเศรษศาสตร์",[20000,20000]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะเศรษศาสตร์",[16400,16400]);

    col.get("มหาวิทยาลัยธรรมศาสตร์").set("คณะสาธารณสุขศาสตร์",[20740,26340]);
    col.get("มหาลัยขอนแก่น").set("คณะสาธารณสุขศาสตร์",[18000,18000]);
    col.get("มหาลัยมหิดล").set("คณะสาธารณสุขศาสตร์",[18000,21000]);

    col.get("มหาลัยขอนแก่น").set("คณะเกษตรศาสตร์",[12000,12000]);
    col.get("มหาลัยเชียงใหม่").set("คณะเกษตรศาสตร์",[16000,16000]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะเกษตรศาสตร์",[17800,17800]);

    col.get("มหาลัยเชียงใหม่").set("คณะมนุษยศาสตร์",[15000,15000]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะมนุษยศาสตร์",[16400,16400]);

    col.get("มหาลัยเชียงใหม่").set("คณะศึกษาสาตร์",[15000,15000]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะศึกษาสาตร์",[16400,16400]);

    col.get("มหาลัยขอนแก่น").set("คณะเทคนิคการแพทย์",[18000,18000]);
    col.get("มหาลัยเชียงใหม่").set("คณะเทคนิคการแพทย์",[20000,20000]);
    col.get("มหาลัยมหิดล").set("คณะเทคนิคการแพทย์",[25000,25000]);

    col.get("มหาลัยเชียงใหม่").set("คณะอุตสาหกรรมเกษตร",[16000,35000]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะอุตสาหกรรมเกษตร",[19800,19800]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("คณะอุตสาหกรรมเกษตร",[21000,21000]);

    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("คณะเทคโนโลยีการเกษตร",[15000,16000]);

    col.get("มหาลัยขอนแก่น").set("คณะสถาปัตยกรรมศาสตร์",[18000,18000]);
    col.get("มหาลัยเชียงใหม่").set("คณะสถาปัตยกรรมศาสตร์",[29000,65000]);
    col.get("มหาลัยเกษตรศาสตร์").set("คณะสถาปัตยกรรมศาสตร์",[19800,19800]);

    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาจุลชีววิทยาทางการแพทย์",[42500,42500]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาชีวเวชศาสตร์",[42500,42500]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาทันตชีววัสดุศาสตร์",[42500,42500]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาสรีรวิทยา",[42500,42500]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาชีวสารสนเทศศาสตร์และชีววิทยาเชิงคอมพิวเตอร์",[42500,42500]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะจิตวิทยา",[33025,33025]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("วิทยาลัยวิทยาศาสตร์สาธารณสุข",[33025,33025]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาเภสัชวิทยา",[33025,33025]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาวิทยาศาสตร์นาโนและเทคโนโลยี",[31875,31875]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม",[31875,31875]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาการจัดการสารอันตรายและสิ่งแวดล้อม",[31875,31875]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาเทคโนโลยีและการจัดการพลังงาน",[31875,31875]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะอักษรศาสตร์",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะนิเทศศาสตร์",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("คณะพาณิชยศาสตร์และการบัญชี",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาการจัดการความเสี่ยงและภัยพิบัติ",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาการจัดการโลจิสติกส์และโซ่อุปทาน",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาการจัดการทางวัฒนธรรม",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาการบริหารกิจการทางทะเล",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาเกาหลีศึกษา",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาพัฒนามนุษย์และสังคม",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาภาษาอังกฤษเป็นภาษานานาชาติ",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชายุโรปศึกษา",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาสิ่งแวดล้อมการพัฒนาและความยั่งยืน",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาเอเชียตะวันออกเฉียงใต้ศึกษา",[26250,26250]);
    col.get("จุฬาลงกรณ์มหาวิทยาลัย").set("สหสาขาวิชาธุรกิจเทคโนโลยีและการจัดการทางนวัตกรรม",[26250,26250]);

    col.get("มหาวิทยาลัยธรรมศาสตร์").set("สังคมสงเคราะห์ศาสตร์",[18040,18040]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("สังคมสงเคราะห์ศาสตร์(ลำปาง)",[23040,23040]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("ศิลปศาสตร์",[19540,19540]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("วารสารศาสตร์และสื่อมวลชน",[19040,19040]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("สังคมวิทยาและมานุษยวิทยา",[17240,17240]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("วิทยาศาสตร์และเทคโนโลยี",[21540,21540]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("วิทยาศาสตร์และเทคโนโลยี(ลำปาง)",[26540,26540]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("วิทยาลัยสหวิทยาการ(ลำปาง)",[22240,22240]);
    col.get("มหาวิทยาลัยธรรมศาสตร์").set("วิทยาการเรียนรู้และศึกษาศาสตร์",[19240,19240]);

    col.get("มหาลัยขอนแก่น").set("วศ.บ.วิศวกรรมศาสตร์ ระบบอัตโนมัติหุ่นยนต์และปัญญาประดิษฐ์",[30000,30000]);
    col.get("มหาลัยขอนแก่น").set("บริหารธุรกิจและการบัญชี",[15000,15000]);
    col.get("มหาลัยขอนแก่น").set("เทคโนโลยี",[12000,12000]);
    col.get("มหาลัยขอนแก่น").set("สหวิทยาการ ",[10000,15000]);
    col.get("มหาลัยขอนแก่น").set("มนุษยศาสตร์และสังคมศาสตร์",[10000,10000]);
    col.get("มหาลัยขอนแก่น").set("ศิลปศาสตร์ ",[10000,30000]);
    col.get("มหาลัยขอนแก่น").set("วิทยาลัยการปกครองท้องถิ่น",[28000,28000]);

    col.get("มหาลัยเชียงใหม่").set("วิจิตรศิลป์",[15000,30000]);
    col.get("มหาลัยเชียงใหม่").set("สังคมศาสตร์",[15000,15000]);
    col.get("มหาลัยเชียงใหม่").set("บริหารธุรกิจ",[15000,15000]);
    col.get("มหาลัยเชียงใหม่").set("การสื่อสารมวลชน",[20000,20000]);
    col.get("มหาลัยเชียงใหม่").set("วิทยาลัยศิลปะ สื่อและเทคโนโลยี ",[33000,40000]);

    col.get("มหาลัยเกษตรศาสตร์").set("บริหารธุรกิจ",[16400,16400]);
    col.get("มหาลัยเกษตรศาสตร์").set("สังคมศาสตร์",[16400,16400]);
    col.get("มหาลัยเกษตรศาสตร์").set("เทคนิคการสัตวแพทย์",[17800,17800]);
    col.get("มหาลัยเกษตรศาสตร์").set("ประมง",[17800,17800]);
    col.get("มหาลัยเกษตรศาสตร์").set("วนศาสตร์",[17800,17800]);
    col.get("มหาลัยเกษตรศาสตร์").set("ศึกษาศาสตร์และพัฒนศาสตร์",[16400,16400]);
    col.get("มหาลัยเกษตรศาสตร์").set("ศิลปศาสตร์และวิทยาศาสตร์ กลุ่มวิทยาศาสตร์",[19800,19800]);
    col.get("มหาลัยเกษตรศาสตร์").set("ศิลปศาสตร์และวิทยาศาสตร์ กลุ่มสังคมศาสตร์",[16400,16400]);

    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("คณะเทคโนโลยีสารสนเทศ",[32000,70000]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("คณะการบริหารและจัดการ",[20000,40000]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("วิทยาลัยนวัตกรรมการผลิตขั้นสูง",[21000,21000]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("วิทยาลัยนาโนเทคโนโลยีพระจอมเกล้า",[25000,25000]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("วิทยาลัยวิศวกรรมสังคีต",[80000,80000]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("วิทยาลัยอุตสาหกรรมการบินนานาชาติ",[530000,530000]);
    col.get("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง").set("คณะการบริหารและจัดการ",[16000,16000]);

    col.get("มหาลัยมหิดล").set("คณะกายภาพบำบัด",[25000,25000]);
    col.get("มหาลัยมหิดล").set("คณะศิลปศาสตร์",[17000,17000]);
    col.get("มหาลัยมหิดล").set("คณะสังคมศาสตร์และมนุษยศาสตร์",[21000,21000]);
    col.get("มหาลัยมหิดล").set("คณะสิ่งแวดล้อมและทรัพยากรศาสตร์",[21000,21000]);
    col.get("มหาลัยมหิดล").set("คณะเทคโนโลยีสารสนเทศและการสื่อสาร",[50000,50000]);

    return col;
  };
  